*> Cobol consists of 4 divisions, where only one is mandatory.
*> The mandatory division is the Identification Division.
*> The other three are the Environment Division, Data Division, and Procedure Division.
identification division.
Program-Id. METAR-DECODER.
 
procedure division.
 
display "Hello, GnuCOBOL".
 
stop run.
       